app/controllers/api/v1/drivers.rb

      end
      post "drivers(json)" do
        driver = Driver.new({organization_id: params[:organization_id], email: params[:email],password: params[:password],first_name: params[:first_name],last_name: params[:last_name],phone: params[:phone]})
        if driver.save
---
INSERT INTO "drivers" ("organization_id", "first_name", "last_name", "phone", "email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

        end
        put "drivers" do
          driver = current_driver
          driver.update(first_name: params[:first_name], last_name: params[:last_name], phone: params[:phone],
                        email: params[:email], car_make: params[:car_make], car_model: params[:car_model],
                        car_color: params[:car_color], radius: params[:radius], is_active: params[:is_active])
---
UPDATE "drivers" SET "car_make" = $1, "car_model" = $2, "car_plate" = $3, "insurance_start" = $4, "insurance_stop" = $5, "updated_at" = $6 WHERE "drivers"."id" = $7